; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared0 - mode
	infrared2 - mode
	infrared4 - mode
	infrared1 - mode
	image3 - mode
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation1 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(supports instrument1 infrared4)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared2)
	(supports instrument5 infrared1)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 infrared4)
	(supports instrument6 infrared2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star4)
	(supports instrument10 infrared0)
	(supports instrument10 image3)
	(supports instrument10 infrared1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet5)
)
(:goal (and
	(pointing satellite2 Star8)
	(pointing satellite4 GroundStation2)
	(have_image Planet5 infrared2)
	(have_image Planet6 infrared4)
	(have_image Planet7 infrared0)
	(have_image Star8 infrared4)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon10 infrared0)
))

)

; plan
1. (turn_to satellite4 groundstation1 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 8
3. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 8
4. (turn_to satellite4 planet7 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet7)
   goals met: 0 of 8
5. (take_image satellite4 planet7 instrument10 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 1 of 8
6. (turn_to satellite4 phenomenon9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 8
7. (take_image satellite4 phenomenon9 instrument10 image3)
   added: (have_image phenomenon9 image3)
   goals met: 2 of 8
8. (turn_to satellite4 phenomenon10 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon10)
   goals met: 2 of 8
9. (turn_to satellite1 star4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star4)
   goals met: 2 of 8
10. (take_image satellite4 phenomenon10 instrument10 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 3 of 8
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 8
12. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 3 of 8
13. (turn_to satellite1 planet5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet5)
   goals met: 3 of 8
14. (take_image satellite1 planet5 instrument1 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 4 of 8
15. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   goals met: 4 of 8
16. (take_image satellite1 planet6 instrument1 infrared4)
   added: (have_image planet6 infrared4)
   goals met: 5 of 8
17. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 5 of 8
18. (take_image satellite1 star8 instrument1 infrared4)
   added: (have_image star8 infrared4)
   goals met: 6 of 8
19. (turn_to satellite2 star8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star8)
   goals met: 7 of 8
20. (turn_to satellite4 groundstation2 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 groundstation2)
   goals met: 8 of 8
